// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
 // кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
 // Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
 
 
			 let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]
			 
			 if (friends.length >= 3) {
				 console.log('Це великий масив, в якому  3 і більше елементи.')
			 } else {
				 console.log('Це великий масив, маленький масив, в якому менше 3-х елементів.')
			 }
			 
			 
			 
  // - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
 // Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
 
			let a = 1
			let b = 3
			let c = 2
 
 
 
			 if (a>b && a<c) {
				 console.log('Середнім значенням являється змінна а')
			 } else if (b>a && b<c) {
				 console.log('Середнім значенням являється змінна b')
			 } else if (c>a && c<b) {
				 console.log('Середнім значенням являється змінна c')
			 } else {
				 console.log("Error")
			 }
 
 

  // - Перепишіть конструкцію if з використанням умовного оператора '?':
			 // let result
			 // if (a + b < 4) {
				// result = 'Мало';
			 // } else {
				// result = 'Багато';
			 // }
			
			 let result = (a + b < 4) ? 'Мало' : 'Багато'
			 
 // - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором	
			let num = 23
			let res = (num > 0) ? 'Число є позитивним' : 'Число є негативним, або нулем'

			console.log(res)
			
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

			test = false

			let answer = (test) ? console.log(true) : console.log(false) 

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

			let q = prompt('Яка «офіційна» назва JavaScript?')

			if (q === 'ECMAScript') {
				console.log('Правильно!')
				
			} else {
				console.log('Не знаєте? ECMAScript!')
}


 // - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

			let entrance = prompt('Оберіть, будь-ласка, номер квартири')

			if (entrance <= 20) {
				console.log("Дана квартиа знаходиться в 1 під'їзді")
			} else if (entrance >= 21 && entrance <= 48) {
				console.log("Дана квартиа знаходиться в 2 під'їзді")
			} else if (entrance >= 49 && entrance <= 90) {
				console.log("Дана квартиа знаходиться в 3 під'їзді")
			}

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, 
// якщо змінна не рівна 10 - тоді НЕВІРНО

			let number = prompt('Задайте будь ласка числове значення!')

			if (number === 10) {
				console.log('ВІРНО')
			} else {
				console.log('НЕВІРНО')
			}


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

			let temperature = prompt('Введіть значення температури')

			if (temperature > 10 && temperature <= 22) {
				console.log('ми йдемо ВЧИТИСЯ')
			} else {
				console.log('сидимо вдома і вчимося ОНЛАЙН')
			}
			
 // - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді вивести Повідомлення - що число не вірне ... .

			 let game = prompt('Введіть число від 1 до 5')
			 
			switch(game) {
				case '1':
				  console.log('Ви виграли Авто!')
				  break
				case '2':
				  console.log('На жаль Ви нічого не виграли(')
				  break
				  case '3':
				  console.log('Ви виграли Мото!')
				  break
				  case '4':
				  console.log('Ви виграли Телефн!')
				  break
				  case '5':
				  console.log('На жаль Ви нічого не виграли(')
			 }
			 
			 
 
 
			 